
//dmarenin
&НаСервере
Функция ПолучитьНомерТелефонаПользователя()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	НомераПользователейСрезПоследних.Номер КАК Номер
		|ИЗ
		|	РегистрСведений.НомераПользователей.СрезПоследних КАК НомераПользователейСрезПоследних
		|ГДЕ
		|	НомераПользователейСрезПоследних.Пользователь = &Пользователь";
	
	Запрос.УстановитьПараметр("Пользователь", ПараметрыСеанса.ТекущийПользователь);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда 

		Возврат ВыборкаДетальныеЗаписи.Номер;
		
	КонецЕсли;
	
	Возврат "";
	
КонецФункции

&НаКлиенте
Процедура ПозвонитьКлиенту(Команда)
	
	channel = ПолучитьНомерТелефонаПользователя();
	exten = Объект.НомерТелефона;
	
	ТелоЗапроса = "channel="+channel+"&exten="+exten;
	
	ИмяКоманды = "make_call";
	Сервер = "192.168.180.150";
	ПортСервера = "8090";
	ТаймАут = 15;
	
	Соединение = Новый HTTPСоединение(Сервер, ПортСервера,,,,ТаймАут);
	
	Запрос = Новый HTTPЗапрос("/"+ИмяКоманды+"?"+ТелоЗапроса);
	
	Результат = Неопределено;
	
	Попытка
		
		Результат = Соединение.Получить(Запрос);
		
	Исключение
		
	КонецПопытки;

КонецПроцедуры

&НаКлиенте
Процедура ПрослушатьЗаписьЗвонка(Команда)
	
	Адрес = "http://192.168.180.150:8099/calls/recordings?"; 
	
	ЗапуститьПриложение(Адрес+Объект.ЗаписьРазговора);

КонецПроцедуры
//dmarenin
