//dmarenin
&НаКлиенте
Процедура СтартоватьОжиданиеОповещений() экспорт
	
	#Если НаКлиенте Тогда	
		
		СистемнаяИнформация = Новый СистемнаяИнформация;
		Если Не СистемнаяИнформация.ТипПлатформы = ТипПлатформы.Windows_x86 Тогда
			
			Возврат;

		КонецЕсли;
		
		РезультатПодключения = ПодключитьВнешнююКомпоненту("ОбщийМакет.СокетВК", "Socket", ТипВнешнейКомпоненты.Native);
		Если Не РезультатПодключения Тогда 
			
			УстановитьВнешнююКомпоненту("ОбщийМакет.СокетВК");
			
		КонецЕсли;
		
		РезультатПодключения = ПодключитьВнешнююКомпоненту("ОбщийМакет.СокетВК", "Socket", ТипВнешнейКомпоненты.Native);
		Если Не РезультатПодключения Тогда 
			
			Сообщить("Ошибка подключения внешней компоненты для работы с сокетом");
			
			Возврат;
			
		КонецЕсли;
		
		Попытка		
			
			Сокет = Новый("AddIn.Socket.EventListener");
			
		Исключение
			
			Сообщить(ОписаниеОшибки());
			
			Возврат;
			
		КонецПопытки;
		
		Попытка
			
			Сокет.хост = "192.168.180.150";
			Сокет.ссылка = ПолучитьНавиСсылкуКлиент(Пользователи.ТекущийПользователь());
			
			Сокет.Подключить();
			
		Исключение
			
			Сообщить(ОписаниеОшибки());
			
			Возврат;
			
		КонецПопытки;
		
	#КонецЕсли
	
КонецПроцедуры
//dmarenin

//dmarenin
&НаКлиенте
Функция ПолучитьНавиСсылкуКлиент(Ссылка) экспорт
	
	НавиСсылка = ПолучитьНавигационнуюСсылку(Ссылка);
	ПоискПозиции = Найти(НавиСсылка, "ref=");
	НавиСсылка = Прав(НавиСсылка, стрДлина(НавиСсылка) - (ПоискПозиции + 3));
	
	Возврат НавиСсылка;
	
КонецФункции
//dmarenin

//dmarenin
&НаСервере
Функция ПолучитьТекущегоПользователя()
	
	Возврат ПараметрыСеанса.ТекущийПользователь;
	
КонецФункции
//dmarenin

//dmarenin
&НаКлиенте
Процедура ОбработкаВнешнегоСобытияСокет(Источник, Событие, ДанныеСобытия) Экспорт 
	
	//Сообщить(Источник+" -> "+ДанныеСобытия);
	
	Если Сред(ДанныеСобытия, 0,13)="Connected to " Тогда 
		
		РаботаСВебСервисом.ПривязатьНомерТелефонаКСокету();
		
	Иначе
		
		Данные = JSON.лПрочитатьJSON(ДанныеСобытия);
		
		Если Данные["event"]="ringing" Тогда 
			
			ОписаниеСобытия = РаботаСВебСервисом.ПолучитьОписаниеСобытия(Данные["ref"]);
			Если ОписаниеСобытия.Событие.Пустая() Тогда 
				Возврат;
			КонецЕсли;
			
			Пояснение = ОписаниеСобытия.НомерТелефона+Символы.ПС+Строка(ОписаниеСобытия.Клиент); 
			
			Текст = "Входящий звонок";
			
			ПоказатьОповещениеПользователя(Текст, ПолучитьНавигационнуюСсылку(ОписаниеСобытия.Событие), Пояснение, БиблиотекаКартинок.бтНачатьРазговор, СтатусОповещенияПользователя.Информация);
			
			
			ПараметрыОткрытия = Новый Структура;
			
			ПараметрыОткрытия.Вставить("Ключ", ОписаниеСобытия.Событие);
			
			ОткрытьФорму("Документ.Событие.Форма.ФормаВходящегоЗвонка", ПараметрыОткрытия);
			
		ИначеЕсли Данные["event"]="call_up" Тогда 
			
			Событие = РаботаСВебСервисом.ПолучитьСобытиеПоИд(Данные["unique_id"]);
			Если Событие=Неопределено Тогда 
				Возврат;
			КонецЕсли;
			
			ПараметрыОткрытия = Новый Структура;
			
			ПараметрыОткрытия.Вставить("Ключ", Событие);
			
			ОткрытьФорму("Документ.Событие.Форма.ФормаВходящегоЗвонка", ПараметрыОткрытия);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры
//dmarenin

