Функция v1get(Запрос)
	
	УстановитьПривилегированныйРежим(Истина);
	
	ИмяМетода = Запрос.ПараметрыЗапроса["method"];
	Данные = Запрос.ПараметрыЗапроса["data"];

	Результат = Неопределено;
	КодОтвета = 200;
	
	Если ИмяМетода = "init_call" Тогда 
		
		Результат = РаботаСВебСервисом.init_call(Данные);
		
	ИначеЕсли ИмяМетода = "done_call" Тогда 
		
		Результат = РаботаСВебСервисом.done_call(Данные);
		
	ИначеЕсли ИмяМетода = "add_recordings" Тогда 
		
		Результат = РаботаСВебСервисом.add_recordings(Данные);
		
	КонецЕсли;
	
	Результат = JSON.лЗаписатьJSON(Результат);
	
	Ответ = Новый HTTPСервисОтвет(КодОтвета);
	
	Ответ.УстановитьТелоИзСтроки(Результат, КодировкаТекста.UTF8, ИспользованиеByteOrderMark.НеИспользовать);
	
	Возврат Ответ;
	
КонецФункции

Функция v1post(Запрос)
	
	УстановитьПривилегированныйРежим(Истина);
	
	ИмяМетода = Запрос.ПараметрыЗапроса["method"];
	
	Результат = Неопределено;
	
	Результат = JSON.лЗаписатьJSON(Результат);
	
	Ответ = Новый HTTPСервисОтвет(200);
	
	Ответ.УстановитьТелоИзСтроки(Результат, КодировкаТекста.UTF8, ИспользованиеByteOrderMark.НеИспользовать);
	
	Возврат Ответ;
	
КонецФункции
